app/controllers/TasksController.rb

    def create
       @task = Task.new(params.require(:task).permit(:description,:status))
       @task.save
---
INSERT INTO "tasks" ("description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "TESTESTESTE"], ["status", 1], ["created_at", "2020-07-11 22:05:27.236573"], ["updated_at", "2020-07-11 22:05:27.236573"]]